Revit 2027 API
ConceptualConstructionOpeningType Enumeration
 ConceptualConstructionType values for Openings.
Namespace: Autodesk.Revit.DB.Analysis
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public enum ConceptualConstructionOpeningType
Public Enumeration ConceptualConstructionOpeningType
public enum class ConceptualConstructionOpeningType
type ConceptualConstructionOpeningType
Members
Member name | Value | Description
Air | 0 |  Air Opening
InvalidOpeningTypeConstruction | -1 |  Invalid value/not set Opening Type Construction
NumOpeningTypeConstruction | 1 |  Total Number of Opening Type Constructions
See Also
Reference
Autodesk.Revit.DB.Analysis Namespace